7767517
154 185
Input                    in0                      0 1 in0
Convolution              conv_1                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_48                  1 1 1 2
Convolution              conv_2                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_49                  1 1 3 4
Convolution              conv_3                   1 1 4 5 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_50                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,32,32 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_4                   1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_51                  1 1 12 13
Convolution              conv_5                   1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_52                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Split                    splitncnn_1              1 3 16 17 18 19
Convolution              conv_6                   1 1 19 20 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_53                  1 1 20 21
Convolution              conv_7                   1 1 21 22 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_54                  1 1 22 23
BinaryOp                 add_1                    2 1 18 23 24 0=0
Concat                   cat_0                    4 1 7 9 17 24 25 0=0
Convolution              conv_8                   1 1 25 26 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_55                  1 1 26 27
Convolution              conv_9                   1 1 27 28 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_56                  1 1 28 29
Convolution              conv_10                  1 1 29 30 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_57                  1 1 30 31
Slice                    split_1                  1 2 31 32 33 -23300=2,32,32 1=0
Split                    splitncnn_2              1 3 33 34 35 36
Convolution              conv_11                  1 1 36 37 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_58                  1 1 37 38
Convolution              conv_12                  1 1 38 39 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_59                  1 1 39 40
BinaryOp                 add_2                    2 1 35 40 41 0=0
Split                    splitncnn_3              1 3 41 42 43 44
Convolution              conv_13                  1 1 44 45 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_60                  1 1 45 46
Convolution              conv_14                  1 1 46 47 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_61                  1 1 47 48
BinaryOp                 add_3                    2 1 43 48 49 0=0
Concat                   cat_1                    4 1 32 34 42 49 50 0=0
Convolution              conv_15                  1 1 50 51 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_62                  1 1 51 52
Convolution              conv_16                  1 1 52 53 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_63                  1 1 53 54
Convolution              conv_17                  1 1 54 55 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_64                  1 1 55 56
Slice                    split_2                  1 2 56 57 58 -23300=2,64,64 1=0
Split                    splitncnn_4              1 3 58 59 60 61
Convolution              conv_18                  1 1 61 62 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_65                  1 1 62 63
Split                    splitncnn_5              1 2 63 64 65
Convolution              conv_19                  1 1 65 66 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_66                  1 1 66 67
Convolution              conv_20                  1 1 67 68 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_67                  1 1 68 69
BinaryOp                 add_4                    2 1 64 69 70 0=0
Split                    splitncnn_6              1 2 70 71 72
Convolution              conv_21                  1 1 72 73 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_68                  1 1 73 74
Convolution              conv_22                  1 1 74 75 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_69                  1 1 75 76
BinaryOp                 add_5                    2 1 71 76 77 0=0
Convolution              conv_23                  1 1 60 78 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_70                  1 1 78 79
Concat                   cat_2                    2 1 77 79 80 0=0
Convolution              conv_24                  1 1 80 81 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_71                  1 1 81 82
Concat                   cat_3                    3 1 57 59 82 83 0=0
Convolution              conv_25                  1 1 83 84 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_72                  1 1 84 85
Convolution              conv_26                  1 1 85 86 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_73                  1 1 86 87
Convolution              conv_27                  1 1 87 88 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_74                  1 1 88 89
Slice                    split_3                  1 2 89 90 91 -23300=2,128,128 1=0
Split                    splitncnn_7              1 3 91 92 93 94
Convolution              conv_28                  1 1 94 95 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_75                  1 1 95 96
Split                    splitncnn_8              1 2 96 97 98
Convolution              conv_29                  1 1 98 99 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_76                  1 1 99 100
Convolution              conv_30                  1 1 100 101 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_77                  1 1 101 102
BinaryOp                 add_6                    2 1 97 102 103 0=0
Split                    splitncnn_9              1 2 103 104 105
Convolution              conv_31                  1 1 105 106 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_78                  1 1 106 107
Convolution              conv_32                  1 1 107 108 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_79                  1 1 108 109
BinaryOp                 add_7                    2 1 104 109 110 0=0
Convolution              conv_33                  1 1 93 111 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_80                  1 1 111 112
Concat                   cat_4                    2 1 110 112 113 0=0
Convolution              conv_34                  1 1 113 114 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_81                  1 1 114 115
Concat                   cat_5                    3 1 90 92 115 116 0=0
Convolution              conv_35                  1 1 116 117 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_82                  1 1 117 118
Convolution              conv_36                  1 1 118 119 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_83                  1 1 119 120
Slice                    split_4                  1 2 120 121 122 -23300=2,128,128 1=0
Split                    splitncnn_10             1 2 122 123 124
Convolution              conv_37                  1 1 124 125 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  reshape_91               1 1 125 126 0=144 1=128 2=2
Slice                    split_5                  1 3 126 127 128 129 -23300=3,32,32,64 1=1
Split                    splitncnn_11             1 2 129 130 131
Permute                  transpose_103            1 1 127 132 0=1
MatMul                   matmul_99                2 1 132 128 133
BinaryOp                 mul_8                    1 1 133 134 0=2 1=1 2=0.176776692
Softmax                  softmax_88               1 1 134 135 0=2 1=1
MatMul                   matmultransb_0           2 1 131 135 136 0=1
Reshape                  reshape_92               1 1 136 137 0=12 1=12 2=128
Reshape                  reshape_93               1 1 130 138 0=12 1=12 2=128
ConvolutionDepthWise     convdw_107               1 1 138 139 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
BinaryOp                 add_9                    2 1 137 139 140 0=0
Convolution              conv_38                  1 1 140 141 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_10                   2 1 123 141 142 0=0
Split                    splitncnn_12             1 2 142 143 144
Convolution              conv_39                  1 1 144 145 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_84                  1 1 145 146
Convolution              conv_40                  1 1 146 147 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_11                   2 1 143 147 148 0=0
Split                    splitncnn_13             1 2 148 149 150
Convolution              conv_41                  1 1 150 151 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  reshape_94               1 1 151 152 0=144 1=128 2=2
Slice                    split_6                  1 3 152 153 154 155 -23300=3,32,32,64 1=1
Split                    splitncnn_14             1 2 155 156 157
Permute                  transpose_105            1 1 153 158 0=1
MatMul                   matmul_101               2 1 158 154 159
BinaryOp                 mul_12                   1 1 159 160 0=2 1=1 2=0.176776692
Softmax                  softmax_89               1 1 160 161 0=2 1=1
MatMul                   matmultransb_1           2 1 157 161 162 0=1
Reshape                  reshape_95               1 1 162 163 0=12 1=12 2=128
Reshape                  reshape_96               1 1 156 164 0=12 1=12 2=128
ConvolutionDepthWise     convdw_108               1 1 164 165 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
BinaryOp                 add_13                   2 1 163 165 166 0=0
Convolution              conv_42                  1 1 166 167 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_14                   2 1 149 167 168 0=0
Split                    splitncnn_15             1 2 168 169 170
Convolution              conv_43                  1 1 170 171 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_85                  1 1 171 172
Convolution              conv_44                  1 1 172 173 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_15                   2 1 169 173 174 0=0
Concat                   cat_6                    2 1 121 174 175 0=0
Convolution              conv_45                  1 1 175 176 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_86                  1 1 176 177
Convolution              conv_46                  1 1 177 178 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=327680
Swish                    silu_87                  1 1 178 179
Pooling                  gap_0                    1 1 179 180 0=1 4=1
Reshape                  reshape_97               1 1 180 181 0=1 1=1 2=-1
Flatten                  flatten_98               1 1 181 182
InnerProduct             linear_47                1 1 182 183 0=3 1=1 2=3840
Softmax                  softmax_90               1 1 183 out0 0=0 1=1
